benchmark-output/storage-engine-disk/outputLoad-a-100000.log
2021-05-12 18:54:12:255 0 sec: 0 operations; est completion in 0 second 
2021-05-12 18:54:22:172 10 sec: 17243 operations; 1724.13 current ops/sec; est completion in 48 seconds [INSERT AverageLatency(us)=568.83] 
2021-05-12 18:54:32:172 20 sec: 35275 operations; 1803.38 current ops/sec; est completion in 37 seconds [INSERT AverageLatency(us)=549.59] 
2021-05-12 18:54:42:172 30 sec: 52931 operations; 1765.6 current ops/sec; est completion in 27 seconds [INSERT AverageLatency(us)=561.91] 
2021-05-12 18:54:52:172 40 sec: 70657 operations; 1772.6 current ops/sec; est completion in 17 seconds [INSERT AverageLatency(us)=560.14] 
2021-05-12 18:55:02:172 50 sec: 87315 operations; 1665.63 current ops/sec; est completion in 8 second [INSERT AverageLatency(us)=596.11] 
2021-05-12 18:55:12:172 60 sec: 99722 operations; 1240.7 current ops/sec; est completion in 1 second [INSERT AverageLatency(us)=801.01] 
2021-05-12 18:55:12:350 60 sec: 100000 operations; 1561.8 current ops/sec; [CLEANUP AverageLatency(us)=366] [INSERT AverageLatency(us)=633.77] 
[OVERALL], RunTime(ms), 60179
[OVERALL], Throughput(ops/sec), 1661.709234118214
[TOTAL_GCS_G1_Young_Generation], Count, 11
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 28
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.04652785855531
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 11
[TOTAL_GC_TIME], Time(ms), 28
[TOTAL_GC_TIME_%], Time(%), 0.04652785855531
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 366.0
[CLEANUP], MinLatency(us), 366
[CLEANUP], MaxLatency(us), 366
[CLEANUP], 0, 366.0
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 596.1306
[INSERT], MinLatency(us), 178
[INSERT], MaxLatency(us), 35253
[INSERT], Return=OK, 100000
[INSERT], 0, 649.3257180156658
[INSERT], 1000, 542.4413223140496
[INSERT], 2000, 583.1868327402135
[INSERT], 3000, 604.2924297924297
[INSERT], 4000, 544.656043956044
[INSERT], 5000, 564.5139601139601
[INSERT], 6000, 573.3796296296297
[INSERT], 7000, 532.5827067669173
[INSERT], 8000, 568.5140562248996
[INSERT], 9000, 544.6959868059373
[INSERT], 10000, 557.8925154755206
[INSERT], 11000, 565.125854214123
[INSERT], 12000, 535.4440842787683
[INSERT], 13000, 539.1060358890702
[INSERT], 14000, 588.8366983372922
[INSERT], 15000, 552.6847098214286
[INSERT], 16000, 540.2735694822888
[INSERT], 17000, 543.0487404162103
[INSERT], 18000, 519.9339276350288
[INSERT], 19000, 565.7621220764404
[INSERT], 20000, 537.286257468767
[INSERT], 21000, 577.2733604178758
[INSERT], 22000, 549.7443150305047
[INSERT], 23000, 552.0656649972176
[INSERT], 24000, 569.5539609644087
[INSERT], 25000, 564.7112756264237
[INSERT], 26000, 572.9289428076256
[INSERT], 27000, 563.8185437997724
[INSERT], 28000, 545.1891148982958
[INSERT], 29000, 588.7214964370546
[INSERT], 30000, 521.4015789473684
[INSERT], 31000, 605.3262195121952
[INSERT], 32000, 542.4917943107221
[INSERT], 33000, 574.8591304347826
[INSERT], 34000, 558.0703828828829
[INSERT], 35000, 557.3856502242153
[INSERT], 36000, 572.7108294930875
[INSERT], 37000, 549.0673660960795
[INSERT], 38000, 562.1678914641041
[INSERT], 39000, 565.8150256118383
[INSERT], 40000, 638.3763648041105
[INSERT], 41000, 600.9431680773881
[INSERT], 42000, 565.1962457337884
[INSERT], 43000, 550.3071389042613
[INSERT], 44000, 550.53211517165
[INSERT], 45000, 584.8582352941177
[INSERT], 46000, 590.4084423305588
[INSERT], 47000, 586.0135533294049
[INSERT], 48000, 658.4625579854209
[INSERT], 49000, 672.6756939742721
[INSERT], 50000, 723.0313182811362
[INSERT], 51000, 740.2779433681073
[INSERT], 52000, 678.056693989071
[INSERT], 53000, 1110.6069428891378
[INSERT], 54000, 2232.159550561798
[INSERT], 55000, 966.201171875
[INSERT], 56000, 918.7760368663594
[INSERT], 57000, 643.0661049902786
[INSERT], 58000, 595.4583083383324
[INSERT], 59000, 637.8786906290115
[INSERT], 60000, 531.6459627329192