benchmark-output/storage-engine-disk/outputLoad-b-100000.log
2021-05-12 19:21:02:604 0 sec: 0 operations; est completion in 0 second 
2021-05-12 19:21:12:534 10 sec: 17266 operations; 1726.43 current ops/sec; est completion in 48 seconds [INSERT AverageLatency(us)=566.65] 
2021-05-12 19:21:22:534 20 sec: 34864 operations; 1759.8 current ops/sec; est completion in 38 seconds [INSERT AverageLatency(us)=562.96] 
2021-05-12 19:21:32:534 30 sec: 52857 operations; 1799.3 current ops/sec; est completion in 27 seconds [INSERT AverageLatency(us)=551.06] 
2021-05-12 19:21:42:534 40 sec: 70597 operations; 1774 current ops/sec; est completion in 17 seconds [INSERT AverageLatency(us)=559.67] 
2021-05-12 19:21:52:534 50 sec: 88620 operations; 1802.3 current ops/sec; est completion in 7 second [INSERT AverageLatency(us)=551.58] 
2021-05-12 19:21:58:906 56 sec: 100000 operations; 1785.94 current ops/sec; [CLEANUP AverageLatency(us)=417] [INSERT AverageLatency(us)=556.73] 
[OVERALL], RunTime(ms), 56373
[OVERALL], Throughput(ops/sec), 1773.8988522874427
[TOTAL_GCS_G1_Young_Generation], Count, 11
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 22
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.03902577475032373
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 11
[TOTAL_GC_TIME], Time(ms), 22
[TOTAL_GC_TIME_%], Time(%), 0.03902577475032373
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 417.0
[CLEANUP], MinLatency(us), 417
[CLEANUP], MaxLatency(us), 417
[CLEANUP], 0, 417.0
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 558.11154
[INSERT], MinLatency(us), 179
[INSERT], MaxLatency(us), 15275
[INSERT], Return=OK, 100000
[INSERT], 0, 666.716316858497
[INSERT], 1000, 549.2474860335195
[INSERT], 2000, 549.2060301507538
[INSERT], 3000, 524.6305732484077
[INSERT], 4000, 592.5455635491606
[INSERT], 5000, 530.3914666666667
[INSERT], 6000, 551.0483602001111
[INSERT], 7000, 582.8504122497055
[INSERT], 8000, 572.264858626659
[INSERT], 9000, 568.5472895040369
[INSERT], 10000, 554.5511679644048
[INSERT], 11000, 590.9624553039332
[INSERT], 12000, 537.0731310942579
[INSERT], 13000, 571.757785467128
[INSERT], 14000, 551.7087542087542
[INSERT], 15000, 563.5159090909091
[INSERT], 16000, 559.8226990400904
[INSERT], 17000, 572.9439306358381
[INSERT], 18000, 536.440778799351
[INSERT], 19000, 608.215033887862
[INSERT], 20000, 536.8705501618123
[INSERT], 21000, 593.6696588868941
[INSERT], 22000, 537.1712737127372
[INSERT], 23000, 561.1352574985851
[INSERT], 24000, 541.8095762245459
[INSERT], 25000, 543.3177366702938
[INSERT], 26000, 550.5163797890061
[INSERT], 27000, 539.2954298150163
[INSERT], 28000, 562.1189801699717
[INSERT], 29000, 554.4628283957518
[INSERT], 30000, 567.2065217391304
[INSERT], 31000, 555.7825112107623
[INSERT], 32000, 563.4438106103822
[INSERT], 33000, 547.8514034122179
[INSERT], 34000, 563.3928368391131
[INSERT], 35000, 519.6844305120168
[INSERT], 36000, 563.4246031746031
[INSERT], 37000, 577.8664343786295
[INSERT], 38000, 562.8588435374149
[INSERT], 39000, 565.0795454545455
[INSERT], 40000, 558.530073074761
[INSERT], 41000, 561.2303783173348
[INSERT], 42000, 568.865174985657
[INSERT], 43000, 541.0829718004338
[INSERT], 44000, 510.27618069815196
[INSERT], 45000, 508.27109974424553
[INSERT], 46000, 542.2307692307693
[INSERT], 47000, 598.173180998196
[INSERT], 48000, 554.3379810373675
[INSERT], 49000, 585.2889935256032
[INSERT], 50000, 544.8699945145365
[INSERT], 51000, 586.1819787985866
[INSERT], 52000, 538.2663779101246
[INSERT], 53000, 598.043295249549
[INSERT], 54000, 530.272
[INSERT], 55000, 566.8711516533638
[INSERT], 56000, 509.6954022988506