benchmark-output/storage-engine-disk/outputRun-a-100000.log
2021-05-12 18:56:11:613 0 sec: 0 operations; est completion in 0 second 
2021-05-12 18:56:21:546 10 sec: 16783 operations; 1678.13 current ops/sec; est completion in 50 seconds [READ AverageLatency(us)=583.35] [UPDATE AverageLatency(us)=577.08] 
2021-05-12 18:56:31:546 20 sec: 33855 operations; 1707.37 current ops/sec; est completion in 40 seconds [READ AverageLatency(us)=579.86] [UPDATE AverageLatency(us)=581.16] 
2021-05-12 18:56:41:546 30 sec: 51987 operations; 1813.2 current ops/sec; est completion in 28 seconds [READ AverageLatency(us)=546.6] [UPDATE AverageLatency(us)=546.87] 
2021-05-12 18:56:51:546 40 sec: 70450 operations; 1846.3 current ops/sec; est completion in 17 seconds [READ AverageLatency(us)=535.45] [UPDATE AverageLatency(us)=540.13] 
2021-05-12 18:57:01:546 50 sec: 88823 operations; 1837.3 current ops/sec; est completion in 7 second [READ AverageLatency(us)=534.5] [UPDATE AverageLatency(us)=547.87] 
2021-05-12 18:57:07:702 56 sec: 100000 operations; 1815.63 current ops/sec; [READ AverageLatency(us)=546.11] [CLEANUP AverageLatency(us)=822] [UPDATE AverageLatency(us)=549.07] 
[OVERALL], RunTime(ms), 56156
[OVERALL], Throughput(ops/sec), 1780.7536149298382
[TOTAL_GCS_G1_Young_Generation], Count, 5
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 15
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.026711304223947574
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 0.026711304223947574
[READ], Operations, 49938
[READ], AverageLatency(us), 554.090091713725
[READ], MinLatency(us), 179
[READ], MaxLatency(us), 16598
[READ], Return=OK, 49938
[READ], 0, 709.4761904761905
[READ], 1000, 642.4650499286734
[READ], 2000, 622.4319018404908
[READ], 3000, 543.2092511013216
[READ], 4000, 566.3113708820404
[READ], 5000, 474.36355475763014
[READ], 6000, 617.1711590296496
[READ], 7000, 555.9944382647386
[READ], 8000, 628.9143546441496
[READ], 9000, 559.9222096956031
[READ], 10000, 638.4993446920053
[READ], 11000, 512.3093980992609
[READ], 12000, 651.1322537112011
[READ], 13000, 548.0530035335689
[READ], 14000, 638.5359042553191
[READ], 15000, 567.1788888888889
[READ], 16000, 606.5041816009558
[READ], 17000, 551.4259471871412
[READ], 18000, 559.8633879781421
[READ], 19000, 553.9314040728832
[READ], 20000, 573.4334811529933
[READ], 21000, 520.4052004333695
[READ], 22000, 537.54476806904
[READ], 23000, 522.0779069767442
[READ], 24000, 565.4965437788019
[READ], 25000, 565.4125144843568
[READ], 26000, 549.6576879910214
[READ], 27000, 550.3426651735722
[READ], 28000, 514.6027944111777
[READ], 29000, 599.8763505402161
[READ], 30000, 532.6598930481283
[READ], 31000, 538.6553980370775
[READ], 32000, 550.6352272727273
[READ], 33000, 547.225027442371
[READ], 34000, 514.0779487179487
[READ], 35000, 557.2793791574279
[READ], 36000, 526.4675186368477
[READ], 37000, 519.4069767441861
[READ], 38000, 520.6324022346369
[READ], 39000, 541.0660980810235
[READ], 40000, 543.2908496732026
[READ], 41000, 521.3293216630196
[READ], 42000, 525.7231450719822
[READ], 43000, 543.4931216931217
[READ], 44000, 573.6786102062975
[READ], 45000, 499.1430051813472
[READ], 46000, 554.3246187363834
[READ], 47000, 502.45454545454544
[READ], 48000, 549.1439909297052
[READ], 49000, 516.3630504833512
[READ], 50000, 554.8398692810457
[READ], 51000, 516.8706896551724
[READ], 52000, 579.1973094170404
[READ], 53000, 542.3993174061434
[READ], 54000, 559.6185792349727
[READ], 55000, 528.0105485232068
[READ], 56000, 649.7857142857143
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 822.0
[CLEANUP], MinLatency(us), 822
[CLEANUP], MaxLatency(us), 822
[CLEANUP], 0, 822.0
[UPDATE], Operations, 50062
[UPDATE], AverageLatency(us), 556.9898126323359
[UPDATE], MinLatency(us), 173
[UPDATE], MaxLatency(us), 16176
[UPDATE], Return=OK, 50062
[UPDATE], 0, 755.357037037037
[UPDATE], 1000, 705.2962466487936
[UPDATE], 2000, 601.0231362467866
[UPDATE], 3000, 527.3901918976546
[UPDATE], 4000, 491.677874186551
[UPDATE], 5000, 428.5956644674835
[UPDATE], 6000, 678.1936305732484
[UPDATE], 7000, 548.6335195530726
[UPDATE], 8000, 579.200495049505
[UPDATE], 9000, 564.0649202733485
[UPDATE], 10000, 626.6464019851117
[UPDATE], 11000, 550.7984749455337
[UPDATE], 12000, 682.5080428954424
[UPDATE], 13000, 553.5852631578947
[UPDATE], 14000, 633.5776397515529
[UPDATE], 15000, 556.5594002306805
[UPDATE], 16000, 598.6840796019901
[UPDATE], 17000, 565.2858744394618
[UPDATE], 18000, 542.7115600448934
[UPDATE], 19000, 525.9304635761589
[UPDATE], 20000, 533.1450892857143
[UPDATE], 21000, 530.8018967334036
[UPDATE], 22000, 539.6174568965517
[UPDATE], 23000, 598.2719200887902
[UPDATE], 24000, 546.5714285714286
[UPDATE], 25000, 551.0196721311476
[UPDATE], 26000, 545.6368593238823
[UPDATE], 27000, 549.7256637168142
[UPDATE], 28000, 512.9860064585575
[UPDATE], 29000, 572.1478060046189
[UPDATE], 30000, 517.7061310782241
[UPDATE], 31000, 550.2054945054945
[UPDATE], 32000, 560.5382907880133
[UPDATE], 33000, 531.0419354838709
[UPDATE], 34000, 523.3127659574468
[UPDATE], 35000, 566.1497695852535
[UPDATE], 36000, 527.0774125132556
[UPDATE], 37000, 560.684794672586
[UPDATE], 38000, 544.1188016528926
[UPDATE], 39000, 539.1355555555556
[UPDATE], 40000, 514.6977225672878
[UPDATE], 41000, 555.3564567769477
[UPDATE], 42000, 586.2071346375144
[UPDATE], 43000, 510.35668789808915
[UPDATE], 44000, 545.3731343283582
[UPDATE], 45000, 535.7874345549739
[UPDATE], 46000, 536.7839029768468
[UPDATE], 47000, 560.4846560846561
[UPDATE], 48000, 582.8630136986301
[UPDATE], 49000, 541.0770042194093
[UPDATE], 50000, 557.6778290993071
[UPDATE], 51000, 535.8704663212435
[UPDATE], 52000, 572.3200483091788
[UPDATE], 53000, 531.8600612870276
[UPDATE], 54000, 559.2148664343787
[UPDATE], 55000, 543.971397139714
[UPDATE], 56000, 504.5263157894737